jmeter/resultados/01-get-books.log
2026-07-08 16:27:35,431 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-07-08 16:27:35,448 INFO o.a.j.JMeter: Loading user properties from: C:\Dev\apache-jmeter-5.6.3\bin\user.properties
2026-07-08 16:27:35,448 INFO o.a.j.JMeter: Loading system properties from: C:\Dev\apache-jmeter-5.6.3\bin\system.properties
2026-07-08 16:27:35,452 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-07-08 16:27:35,453 INFO o.a.j.JMeter: Version 5.6.3
2026-07-08 16:27:35,453 INFO o.a.j.JMeter: java.version=21.0.10
2026-07-08 16:27:35,453 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-07-08 16:27:35,453 INFO o.a.j.JMeter: os.name=Windows 11
2026-07-08 16:27:35,453 INFO o.a.j.JMeter: os.arch=amd64
2026-07-08 16:27:35,453 INFO o.a.j.JMeter: os.version=10.0
2026-07-08 16:27:35,453 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-07-08 16:27:35,453 INFO o.a.j.JMeter: java.awt.headless=true
2026-07-08 16:27:35,454 INFO o.a.j.JMeter: Max memory     =1073741824
2026-07-08 16:27:35,454 INFO o.a.j.JMeter: Available Processors =16
2026-07-08 16:27:35,460 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-07-08 16:27:35,461 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-07-08 16:27:35,461 INFO o.a.j.JMeter: JMeterHome=C:\Dev\apache-jmeter-5.6.3
2026-07-08 16:27:35,461 INFO o.a.j.JMeter: user.dir  =C:\Users\riexd\OneDrive\Documents\pruebas-practica-final
2026-07-08 16:27:35,461 INFO o.a.j.JMeter: PWD       =C:\Users\riexd\OneDrive\Documents\pruebas-practica-final
2026-07-08 16:27:35,462 INFO o.a.j.JMeter: IP: 10.212.134.15 Name: rodrigo FullName: rodrigo
2026-07-08 16:27:35,471 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\01-get-books-reporte'
2026-07-08 16:27:35,472 INFO o.a.j.s.FileServer: Default base='C:\Users\riexd\OneDrive\Documents\pruebas-practica-final'
2026-07-08 16:27:35,473 INFO o.a.j.s.FileServer: Set new base='C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter'
2026-07-08 16:27:35,600 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-07-08 16:27:35,620 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-07-08 16:27:35,623 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-07-08 16:27:35,625 INFO o.a.j.s.SaveService: Loading file: C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\01-get-books.jmx
2026-07-08 16:27:35,669 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-08 16:27:35,669 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-08 16:27:35,669 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-08 16:27:35,669 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-08 16:27:35,669 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-07-08 16:27:35,669 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-07-08 16:27:35,693 INFO o.a.j.JMeter: Creating summariser <summary>
2026-07-08 16:27:35,697 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2026-07-08 16:27:35,697 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: C:/Users/riexd/OneDrive/Documents/pruebas-practica-final/jmeter/resultados/01-get-books.jtl
2026-07-08 16:27:35,697 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: C:\Dev\apache-jmeter-5.6.3\bin\reportgenerator.properties
2026-07-08 16:27:35,698 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2026-07-08 16:27:35,701 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2026-07-08 16:27:35,702 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2026-07-08 16:27:35,702 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2026-07-08 16:27:35,702 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2026-07-08 16:27:35,702 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2026-07-08 16:27:35,703 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2026-07-08 16:27:35,703 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2026-07-08 16:27:35,703 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2026-07-08 16:27:35,703 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2026-07-08 16:27:35,706 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:27:35,706 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:27:35,706 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:27:35,706 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:27:35,706 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:27:35,706 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:27:35,706 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:27:35,706 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:27:35,707 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:27:35,707 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:27:35,707 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2026-07-08 16:27:35,707 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2026-07-08 16:27:35,707 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2026-07-08 16:27:35,708 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2026-07-08 16:27:35,708 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2026-07-08 16:27:35,708 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2026-07-08 16:27:35,719 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-07-08 16:27:35,720 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-07-08 16:27:35,720 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-07-08 16:27:35,723 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-07-08 16:27:35,723 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-07-08 16:27:35,781 INFO o.a.j.r.ResultCollector: Folder at C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\resultados was created
2026-07-08 16:27:35,789 INFO o.a.j.JMeter: Running test (1783546055789)
2026-07-08 16:27:35,799 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Usuarios
2026-07-08 16:27:35,799 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Usuarios.
2026-07-08 16:27:35,799 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-07-08 16:27:35,801 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=2 delayedStart=false
2026-07-08 16:27:35,805 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-07-08 16:27:35,805 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-07-08 16:27:35,805 INFO o.a.j.t.JMeterThread: Thread started: Usuarios 1-1
2026-07-08 16:27:35,822 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = rodrigo
2026-07-08 16:27:35,827 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-07-08 16:27:35,828 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-07-08 16:27:35,828 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-07-08 16:27:35,828 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-07-08 16:27:35,828 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-07-08 16:27:36,021 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2026-07-08 16:27:36,028 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-07-08 16:27:36,029 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-07-08 16:27:36,119 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2026-07-08 16:27:36,123 INFO o.a.j.u.SSLManager: KeyStore created OK
2026-07-08 16:27:36,123 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2026-07-08 16:27:36,204 INFO o.a.j.t.JMeterThread: Thread started: Usuarios 1-2
2026-07-08 16:27:36,603 INFO o.a.j.t.JMeterThread: Thread started: Usuarios 1-3
2026-07-08 16:27:37,002 INFO o.a.j.t.JMeterThread: Thread started: Usuarios 1-4
2026-07-08 16:27:37,403 INFO o.a.j.t.JMeterThread: Thread started: Usuarios 1-5
2026-07-08 16:27:37,633 INFO o.a.j.t.JMeterThread: Thread is done: Usuarios 1-3
2026-07-08 16:27:37,633 INFO o.a.j.t.JMeterThread: Thread is done: Usuarios 1-1
2026-07-08 16:27:37,633 INFO o.a.j.t.JMeterThread: Thread is done: Usuarios 1-2
2026-07-08 16:27:37,634 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios 1-3
2026-07-08 16:27:37,634 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios 1-1
2026-07-08 16:27:37,634 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios 1-2
2026-07-08 16:27:37,775 INFO o.a.j.t.JMeterThread: Thread is done: Usuarios 1-4
2026-07-08 16:27:37,775 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios 1-4
2026-07-08 16:27:38,258 INFO o.a.j.t.JMeterThread: Thread is done: Usuarios 1-5
2026-07-08 16:27:38,258 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios 1-5
2026-07-08 16:27:38,259 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-07-08 16:27:38,261 INFO o.a.j.r.Summariser: summary =      5 in 00:00:02 =    2.0/s Avg:  1154 Min:   772 Max:  1727 Err:     0 (0.00%)
2026-07-08 16:27:38,262 INFO o.a.j.JMeter: Generating Dashboard
2026-07-08 16:27:38,262 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2026-07-08 16:27:38,270 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2026-07-08 16:27:38,310 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2026-07-08 16:27:38,310 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2026-07-08 16:27:38,311 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2026-07-08 16:27:38,311 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2026-07-08 16:27:38,316 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2026-07-08 16:27:38,318 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2026-07-08 16:27:38,318 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2026-07-08 16:27:38,318 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2026-07-08 16:27:38,327 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2026-07-08 16:27:38,327 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2026-07-08 16:27:38,327 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2026-07-08 16:27:38,327 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2026-07-08 16:27:38,329 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2026-07-08 16:27:38,330 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 35 samples
2026-07-08 16:27:38,330 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2026-07-08 16:27:38,330 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2026-07-08 16:27:38,330 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2026-07-08 16:27:38,330 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2026-07-08 16:27:38,330 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2026-07-08 16:27:38,330 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2026-07-08 16:27:38,330 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2026-07-08 16:27:38,331 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2026-07-08 16:27:38,331 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2026-07-08 16:27:38,331 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2026-07-08 16:27:38,331 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 75 samples
2026-07-08 16:27:38,331 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 15 samples
2026-07-08 16:27:38,331 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 5 samples
2026-07-08 16:27:38,332 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 5 samples produced in 45ms on channel 0
2026-07-08 16:27:38,332 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2026-07-08 16:27:38,395 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2026-07-08 16:27:38,395 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2026-07-08 16:27:38,396 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2026-07-08 16:27:38,396 INFO o.a.j.r.d.JsonExporter: Checking output folder
2026-07-08 16:27:38,396 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\01-get-books-reporte\statistics.json
2026-07-08 16:27:38,434 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2026-07-08 16:27:38,436 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\01-get-books-reporte
2026-07-08 16:27:38,520 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\01-get-books-reporte, creating folder structure
2026-07-08 16:27:38,523 INFO o.a.j.r.d.TemplateVisitor: Copying folder from 'C:\Dev\apache-jmeter-5.6.3\bin\report-template' to 'C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\01-get-books-reporte', got message: C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\01-get-books-reporte, found non empty folder with following content [C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\01-get-books-reporte\statistics.json], will be ignored
2026-07-08 16:27:38,792 INFO o.a.j.JMeter: Dashboard generated