jmeter/resultados/06-get-movie-por-slug.log
2026-07-08 16:28:04,581 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-07-08 16:28:04,602 INFO o.a.j.JMeter: Loading user properties from: C:\Dev\apache-jmeter-5.6.3\bin\user.properties
2026-07-08 16:28:04,602 INFO o.a.j.JMeter: Loading system properties from: C:\Dev\apache-jmeter-5.6.3\bin\system.properties
2026-07-08 16:28:04,606 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-07-08 16:28:04,606 INFO o.a.j.JMeter: Version 5.6.3
2026-07-08 16:28:04,606 INFO o.a.j.JMeter: java.version=21.0.10
2026-07-08 16:28:04,606 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-07-08 16:28:04,608 INFO o.a.j.JMeter: os.name=Windows 11
2026-07-08 16:28:04,608 INFO o.a.j.JMeter: os.arch=amd64
2026-07-08 16:28:04,608 INFO o.a.j.JMeter: os.version=10.0
2026-07-08 16:28:04,608 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-07-08 16:28:04,608 INFO o.a.j.JMeter: java.awt.headless=true
2026-07-08 16:28:04,608 INFO o.a.j.JMeter: Max memory     =1073741824
2026-07-08 16:28:04,608 INFO o.a.j.JMeter: Available Processors =16
2026-07-08 16:28:04,616 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-07-08 16:28:04,616 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-07-08 16:28:04,616 INFO o.a.j.JMeter: JMeterHome=C:\Dev\apache-jmeter-5.6.3
2026-07-08 16:28:04,616 INFO o.a.j.JMeter: user.dir  =C:\Users\riexd\OneDrive\Documents\pruebas-practica-final
2026-07-08 16:28:04,617 INFO o.a.j.JMeter: PWD       =C:\Users\riexd\OneDrive\Documents\pruebas-practica-final
2026-07-08 16:28:04,623 INFO o.a.j.JMeter: IP: 10.212.134.15 Name: rodrigo FullName: rodrigo
2026-07-08 16:28:04,632 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\06-get-movie-por-slug-reporte'
2026-07-08 16:28:04,633 INFO o.a.j.s.FileServer: Default base='C:\Users\riexd\OneDrive\Documents\pruebas-practica-final'
2026-07-08 16:28:04,634 INFO o.a.j.s.FileServer: Set new base='C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter'
2026-07-08 16:28:04,775 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-07-08 16:28:04,796 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-07-08 16:28:04,798 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-07-08 16:28:04,801 INFO o.a.j.s.SaveService: Loading file: C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\06-get-movie-por-slug.jmx
2026-07-08 16:28:04,841 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-08 16:28:04,841 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-08 16:28:04,841 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-08 16:28:04,841 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-08 16:28:04,841 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-07-08 16:28:04,841 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-07-08 16:28:04,862 INFO o.a.j.JMeter: Creating summariser <summary>
2026-07-08 16:28:04,865 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2026-07-08 16:28:04,865 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: C:/Users/riexd/OneDrive/Documents/pruebas-practica-final/jmeter/resultados/06-get-movie-por-slug.jtl
2026-07-08 16:28:04,865 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: C:\Dev\apache-jmeter-5.6.3\bin\reportgenerator.properties
2026-07-08 16:28:04,866 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2026-07-08 16:28:04,869 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2026-07-08 16:28:04,871 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2026-07-08 16:28:04,871 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2026-07-08 16:28:04,871 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2026-07-08 16:28:04,871 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2026-07-08 16:28:04,871 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2026-07-08 16:28:04,871 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2026-07-08 16:28:04,871 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2026-07-08 16:28:04,871 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2026-07-08 16:28:04,874 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:28:04,874 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:28:04,874 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:28:04,874 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:28:04,874 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:28:04,874 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:28:04,874 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:28:04,875 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:28:04,875 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:28:04,875 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2026-07-08 16:28:04,875 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2026-07-08 16:28:04,876 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2026-07-08 16:28:04,876 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2026-07-08 16:28:04,876 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2026-07-08 16:28:04,876 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2026-07-08 16:28:04,876 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2026-07-08 16:28:04,885 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-07-08 16:28:04,886 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-07-08 16:28:04,886 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-07-08 16:28:04,890 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-07-08 16:28:04,890 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-07-08 16:28:04,946 INFO o.a.j.JMeter: Running test (1783546084946)
2026-07-08 16:28:04,958 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Usuarios
2026-07-08 16:28:04,959 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Usuarios.
2026-07-08 16:28:04,959 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-07-08 16:28:04,959 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=2 delayedStart=false
2026-07-08 16:28:04,963 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-07-08 16:28:04,963 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-07-08 16:28:04,964 INFO o.a.j.t.JMeterThread: Thread started: Usuarios 1-1
2026-07-08 16:28:04,976 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = rodrigo
2026-07-08 16:28:04,980 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-07-08 16:28:04,981 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-07-08 16:28:04,981 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-07-08 16:28:04,981 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-07-08 16:28:04,981 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-07-08 16:28:05,051 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2026-07-08 16:28:05,055 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-07-08 16:28:05,055 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-07-08 16:28:05,118 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2026-07-08 16:28:05,121 INFO o.a.j.u.SSLManager: KeyStore created OK
2026-07-08 16:28:05,121 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2026-07-08 16:28:05,364 INFO o.a.j.t.JMeterThread: Thread started: Usuarios 1-2
2026-07-08 16:28:05,762 INFO o.a.j.t.JMeterThread: Thread started: Usuarios 1-3
2026-07-08 16:28:05,901 INFO o.a.j.r.Summariser: summary +      1 in 00:00:01 =    1.0/s Avg:   838 Min:   838 Max:   838 Err:     0 (0.00%) Active: 3 Started: 3 Finished: 0
2026-07-08 16:28:05,902 INFO o.a.j.t.JMeterThread: Thread is done: Usuarios 1-1
2026-07-08 16:28:05,902 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios 1-1
2026-07-08 16:28:06,152 INFO o.a.j.t.JMeterThread: Thread is done: Usuarios 1-2
2026-07-08 16:28:06,152 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios 1-2
2026-07-08 16:28:06,160 INFO o.a.j.t.JMeterThread: Thread started: Usuarios 1-4
2026-07-08 16:28:06,538 INFO o.a.j.t.JMeterThread: Thread is done: Usuarios 1-3
2026-07-08 16:28:06,538 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios 1-3
2026-07-08 16:28:06,561 INFO o.a.j.t.JMeterThread: Thread started: Usuarios 1-5
2026-07-08 16:28:06,935 INFO o.a.j.t.JMeterThread: Thread is done: Usuarios 1-4
2026-07-08 16:28:06,935 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios 1-4
2026-07-08 16:28:07,332 INFO o.a.j.t.JMeterThread: Thread is done: Usuarios 1-5
2026-07-08 16:28:07,332 INFO o.a.j.t.JMeterThread: Thread finished: Usuarios 1-5
2026-07-08 16:28:07,332 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-07-08 16:28:07,334 INFO o.a.j.r.Summariser: summary +      4 in 00:00:01 =    2.8/s Avg:   776 Min:   769 Max:   788 Err:     0 (0.00%) Active: 0 Started: 5 Finished: 5
2026-07-08 16:28:07,334 INFO o.a.j.r.Summariser: summary =      5 in 00:00:02 =    2.1/s Avg:   788 Min:   769 Max:   838 Err:     0 (0.00%)
2026-07-08 16:28:07,334 INFO o.a.j.JMeter: Generating Dashboard
2026-07-08 16:28:07,334 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2026-07-08 16:28:07,342 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2026-07-08 16:28:07,376 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2026-07-08 16:28:07,377 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2026-07-08 16:28:07,378 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2026-07-08 16:28:07,378 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2026-07-08 16:28:07,382 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2026-07-08 16:28:07,383 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2026-07-08 16:28:07,383 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2026-07-08 16:28:07,383 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2026-07-08 16:28:07,391 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2026-07-08 16:28:07,391 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2026-07-08 16:28:07,391 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2026-07-08 16:28:07,391 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2026-07-08 16:28:07,393 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2026-07-08 16:28:07,394 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 35 samples
2026-07-08 16:28:07,394 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2026-07-08 16:28:07,394 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2026-07-08 16:28:07,394 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2026-07-08 16:28:07,394 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2026-07-08 16:28:07,394 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2026-07-08 16:28:07,394 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2026-07-08 16:28:07,394 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2026-07-08 16:28:07,395 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2026-07-08 16:28:07,395 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2026-07-08 16:28:07,395 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2026-07-08 16:28:07,395 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 75 samples
2026-07-08 16:28:07,395 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 15 samples
2026-07-08 16:28:07,395 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 5 samples
2026-07-08 16:28:07,395 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 5 samples produced in 37ms on channel 0
2026-07-08 16:28:07,395 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2026-07-08 16:28:07,448 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2026-07-08 16:28:07,449 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2026-07-08 16:28:07,449 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2026-07-08 16:28:07,449 INFO o.a.j.r.d.JsonExporter: Checking output folder
2026-07-08 16:28:07,450 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\06-get-movie-por-slug-reporte\statistics.json
2026-07-08 16:28:07,482 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2026-07-08 16:28:07,484 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\06-get-movie-por-slug-reporte
2026-07-08 16:28:07,556 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\06-get-movie-por-slug-reporte, creating folder structure
2026-07-08 16:28:07,559 INFO o.a.j.r.d.TemplateVisitor: Copying folder from 'C:\Dev\apache-jmeter-5.6.3\bin\report-template' to 'C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\06-get-movie-por-slug-reporte', got message: C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\06-get-movie-por-slug-reporte, found non empty folder with following content [C:\Users\riexd\OneDrive\Documents\pruebas-practica-final\jmeter\resultados\06-get-movie-por-slug-reporte\statistics.json], will be ignored
2026-07-08 16:28:07,786 INFO o.a.j.JMeter: Dashboard generated